hso-esk/emb6/target/mcu/efm32lg990f256/efm32lg990.c
/** UART instance */
static USART_TypeDef* uart = EFM32_UART;
extern USART_TypeDef* uartStdio = NULL;

/** Definition of the SPI interface */
static s_hal_spiDrv s_hal_spi = {
        .pHndl = NULL,
        .clkPin = {EFM32_IO_PORT_USART_CLK, EFM32_IO_PIN_USART_CLK, gpioModePushPull, 0},
        .txPin = {EFM32_IO_PORT_USART_TX, EFM32_IO_PIN_USART_TX, gpioModePushPull, 0},
        .rxPin = {EFM32_IO_PORT_USART_RX, EFM32_IO_PIN_USART_RX, gpioModeInputPull, 0},
        .csPin = {EFM32_IO_PORT_USART_CS, EFM32_IO_PIN_USART_CS, gpioModePushPull, 0}
};

s_hal_gpio_pin_t s_hal_gpio[e_hal_gpios_max] =
{
    {EFM32_IO_PORT_RF_RST, EFM32_IO_PIN_RF_RST, gpioModePushPull,  0},  /* e_hal_gpios_rf_rst */
    {EFM32_IO_PORT_RF_IRQ, EFM32_IO_PIN_RF_IRQ, gpioModeInputPull, 0},  /* e_hal_gpios_rf_irq */
    {EFM32_IO_PORT_RF_SLP, EFM32_IO_PIN_RF_SLP, gpioModePushPull,  0},  /* e_hal_gpios_rf_slp */
};

/** External interrupt GPIOs table */
s_hal_gpio_pin_t s_hal_exti_gpio[E_TARGET_EXT_INT_MAX] =
{
    {EFM32_IO_PORT_RF_IRQ_0, EFM32_IO_PIN_RF_IRQ_0, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_0 */
    {EFM32_IO_PORT_RF_IRQ_2, EFM32_IO_PIN_RF_IRQ_2, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_1 */
    {EFM32_IO_PORT_RF_IRQ_3, EFM32_IO_PIN_RF_IRQ_3, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_2 */
    {0, 0, 0, 0},  /* E_TARGET_EXT_INT_3 is not supported */

    {EFM32_IO_PORT_RF_IRQ,   EFM32_IO_PIN_RF_IRQ,   gpioModeInputPull, 0},  /* INT for Atmel RF */
    {0, 0, 0, 0},  /* E_TARGET_USART_INT is not supported */
};

/** User IOs */
s_hal_gpio_pin_t s_hal_userio[] =
{
    {EFM32_IO_PORT_LED0, EFM32_IO_PIN_LED0, gpioModePushPull,  EFM32_LED_OUT_VAL},  /* LED0 */
    {EFM32_IO_PORT_LED1, EFM32_IO_PIN_LED1, gpioModePushPull, EFM32_LED_OUT_VAL},   /* LED1 */
};

/** External interrupt handler table */
pfn_intCallb_t pf_hal_exti[E_TARGET_EXT_INT_MAX] = {0};

void* p_spiMisoPin = &s_hal_spi.rxPin;

/*==============================================================================
                                LOCAL CONSTANTS
==============================================================================*/

/** mac address */
//const uint8_t mac_address[8] = {RADIO_MAC_ADDR};

/*==============================================================================
                                LOCAL FUNCTIONS
==============================================================================*/

/**
 *    \brief    Timer1 interrupt handler.
 */
void TIMER1_IRQHandler()
{
    uint32_t flags;
    INT_Disable();

    flags = TIMER_IntGet( TIMER1 );
    _hal_tcCb();
    TIMER_IntClear( TIMER1, flags );

    INT_Enable();
}

/**
 *    \brief    Initializes Watchdog.
 */
static void _hal_wdcInit(void)
{
    WDOG_Init_TypeDef wd = {
            FALSE, FALSE, FALSE, FALSE, FALSE,
            FALSE, wdogClkSelLFRCO, wdogPeriod_256k
    };

    /* disable watchdog at initialization*/
    wd.enable = 0;
    WDOG_Init( &wd );

} /* _hal_tcInit() */


/**
 *    \brief    Initializes SysTick.
 */
static void _hal_tcInit(void)
{
    uint32_t l_ticks;
    TIMER_TypeDef* ps_timer = TIMER1;
    TIMER_Init_TypeDef s_timerInit = TIMER_INIT_DEFAULT;

    s_timerInit.enable = true;
    s_timerInit.prescale = timerPrescale2;
    s_timerInit.riseAction = timerInputActionReloadStart;

    /* Calculate ticks */
    l_ticks = SystemHFClockGet() / 2 / 1000;

    /* configure timer for 1ms */
    TIMER_TopSet( ps_timer, l_ticks );
    /* enable timer interrupts */
    NVIC_DisableIRQ( TIMER1_IRQn );
    NVIC_ClearPendingIRQ( TIMER1_IRQn );
    NVIC_EnableIRQ( TIMER1_IRQn );
    TIMER_IntEnable( ps_timer, TIMER_IEN_OF );

    /* initialize and start timer */
    TIMER_Init( ps_timer, &s_timerInit );

} /* _hal_tcInit() */


/**
 *    \brief    Initializes IOs.
 */
static void _hal_clksInit( void )
{
    /* enable required clocks */
    CMU_ClockEnable( cmuClock_HFPER, true );
    CMU_ClockEnable( cmuClock_GPIO, true );
    CMU_ClockEnable( cmuClock_TIMER1, true );
    CMU_ClockEnable(cmuClock_UART0, true);

    CMU_HFRCOBandSet( cmuHFRCOBand_28MHz );
}

/**
 *    \brief    Initialize UART.
 */
static void _hal_uartInit( void )
{
    /* initialize UART for debug */
    USART_InitAsync_TypeDef usartCfg = {
          usartDisable,
          0,
          115200,
          usartOVS16,
          usartDatabits8,
          usartNoParity,
          usartStopbits1
    };

    /* Configure USART for basic async operation */
    USART_InitAsync(uart, &usartCfg);

    /* Use default location 0: TX - Pin F6, RX - Pin F7 */
    /* To avoid false start, configure output as high */
    GPIO_PinModeSet(EFM32_UART_PORT_USART_TX, EFM32_UART_PIN_USART_TX,
            gpioModePushPull, 1);

    /* Define input, no filtering */
    GPIO_PinModeSet(EFM32_UART_PORT_USART_RX, EFM32_UART_PIN_USART_RX,
            gpioModeInput, 0);

    /* Enable pins at default location */
    uart->ROUTE = EFM32_UART_LOC | UART_ROUTE_RXPEN | UART_ROUTE_TXPEN;

    /* Clear previous RX interrupts */
    USART_IntClear(EFM32_UART, UART_IF_RXDATAV);
    NVIC_ClearPendingIRQ( UART0_RX_IRQn);

    /* Finally enable it */
    USART_Enable(uart, usartEnableTx);

    /* set external UART instance */
    uartStdio = uart;
}


/**
 * \brief    SysTick handler to increase internal ticks.
 */
static void _hal_tcCb( void )
{
    /* Indicate timer update to the emb6 timer */
    if( l_hal_tick % CONF_TICK_SEC == 0 )
        l_hal_sec++;
    l_hal_tick++;

  /* update real-time timers*/
  rt_tmr_update();
} /* _isr_tc_interrupt() */


/**
 * \brief   External interrupt handler
 */
static void _hal_extiCb(uint8_t pin)
{
    uint8_t ix;

    for (ix = 0; ix < E_TARGET_EXT_INT_MAX; ix++) {
        if (s_hal_exti_gpio[ix].pin == pin) {
            /*
             * TI and Atmel transceivers use same pin number for one interrupt
             * (EFM32_IO_PORT_RF_IRQ_3 and EFM32_IO_PORT_RF_IRQ). Therefore
             * if an interrupt handling function found with pin number of
             * interest is 0, let MCU iterate interrupt table to find the
             * correct interrupt occurred
             */
            if (pf_hal_exti[ix]) {
                pf_hal_exti[ix](NULL);
            }
        }
    }
}


/*==============================================================================
                                 API FUNCTIONS
==============================================================================*/

/*==============================================================================
  hal_enterCritical()
==============================================================================*/
void hal_enterCritical( void )
{
    /* enter critical section */
    INT_Disable();

